<a href="https://colab.research.google.com/github/theokunj/practice/blob/main/ME_HW1_Q2_3_nasa.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np
import scipy as sp

In [33]:
data = pd.read_csv("/content/airfoil_self_noise.dat", delimiter="\t")
#mean_data = data.mean(axis=0)
table = ['Freq (Hz)', 'Angle of attack (deg)','Chord length, (m)','Free-stream velocity (m/s)','Suction side displacement thickness (m)']
#print(data.shape)
#print(data[1:15])
data.mean(axis=0)

800           2887.769640
0                6.786818
0.3048           0.136436
71.3            50.847137
0.00266337       0.011146
126.201        124.835034
dtype: float64

In [26]:
data.std(axis=0)

800           3153.162983
0                5.917509
0.3048           0.093471
71.3            15.569029
0.00266337       0.013153
126.201          6.900864
dtype: float64

In [27]:
data.median(axis=0)

800           1600.000000
0                5.400000
0.3048           0.101600
71.3            39.600000
0.00266337       0.004957
126.201        125.719000
dtype: float64

In [28]:
data.kurtosis(axis=0)

800           5.704083
0            -0.413399
0.3048       -1.035595
71.3         -1.562758
0.00266337    2.215282
126.201      -0.316058
dtype: float64

In [30]:
data.skew(axis=0)

800           2.136180
0             0.688553
0.3048        0.458497
71.3          0.237297
0.00266337    1.701196
126.201      -0.418439
dtype: float64

In [31]:
data.min(axis=0)

800           200.000000
0               0.000000
0.3048          0.025400
71.3           31.700000
0.00266337      0.000401
126.201       103.380000
dtype: float64

#**Get Range**